Repository: mikemolina/kalendas
Catalog: *.po
Languages: es, pt_br

source: {PROG} requires Perl 5.
es: {PROG} requiere Perl 5.
pt_br: {PROG} requer Perl 5.

source: Written by {autor}, {data}, <mmolina.unphysics@gmail.com>.
es: Escrito por {autor}, {data}, <mmolina.unphysics@gmail.com>.
pt_br: Escrito por {autor}, {data}, <mmolina.unphysics@gmail.com>.

source: Monday
es: Lunes
pt_br: Segunda-feira

source: Tuesday
es: Martes
pt_br: Terça-feira

source: Wednesday
es: Miércoles
pt_br: Quarta-feira

source: Thursday
es: Jueves
pt_br: Quinta-feira

source: Friday
es: Viernes
pt_br: Sexta-feira

source: Saturday
es: Sábado
pt_br: Sábado

source: Sunday
es: Domingo
pt_br: Domingo

source: Many arguments!
es: Muchos argumentos!
pt_br: Muitos argumentos!

source: Year {y} no found in the scale Christian.
es: Año {y} no existe en la escala Cristiana.
pt_br: Ano {y} não existe na escala Cristão.

source: Conversion between calendars equals!!!
es: Conversión entre calendarios iguales!!!
pt_br: Conversão entre mesmos calendários!!!

source: Bad input date!
es: Ingreso incorrecto de fecha!
pt_br: Entrada de data incorreta!

source: Date present: {dsem}, {y}-{m}-{d},
es: Fecha actual: {dsem}, {y}-{m}-{d},
pt_br: Data atual: {dsem}, {y}-{m}-{d},

source: For more information: {PROG} --help
es: Para más información: {PROG} --help
pt_br: Para mais informações: {PROG} --help

source: Data: {dsem}, {era} {y}-{m}-{d},
es: Fecha: {dsem}, {era} {y}-{m}-{d},

source: Data: ({era},{y},{m},{d})
es: Fecha: ({era},{y},{m},{d})

source: Dates between 5 and 14 of October of 1582 no
es: Fechas entre el 5 y 14 de Octubre de 1582 no
pt_br: Não existe datas entre 5 e 14 de Outubro

source: exist for calculus of the Julian Day.
es: existen para el cálculo de la Fecha Juliana.
pt_br: de 1582 para o cálculo do Dia Juliano.

source: Arguments Note: writing quotes ("") is obligatory for input of arguments. 'era':= The position of the year in the Christian scale. With 'aC' denotes ante Christium or before Christ; 'AD', Anno Domini or common era. 'yy':= The year with a number greater than zero. The year zero or a year negative does not exist in the Christian scale. 'mm':= The month with numerical value (1-12). 'dd':= The day of the month. 'tt':= The solar time, has two options of entrance: writing the time universal (UT) in format 'hh:mm:ss', or 'md' that is the hour to noon of Greenwich (12:00:00 UT). 'jd':= The Julian date. The integer and decimal parts the 'jd' represent the Julian day number and Julian day fraction respectively. With five numbers decimals the time is obtained with precision of 1 second. 'jd' can be a negative number. 'mjd':= The modified Julian date; argument similarly to jd.
es: Argumentos Nota: escritura de comillas ("") es obligatoria para ingreso de argumentos. 'era':= Es la posición del año en la escala cristiana. Con 'aC' denota ante Christium o antes de Cristo; 'AD', Anno Domini o despues de Cristo. 'yy':= El año con un número mayor que cero. El año cero o un año negativo no existe en la escala cristiana. 'mm':= El mes con valor numérico (1-12). 'dd':= El día del mes. 'tt':= La hora solar, tiene dos opciones de ingreso: escribiendo el tiempo universal (UT) en formato 'hh:mm:ss', o 'md' que es la hora a medio día de Greenwich (12:00:00 UT). 'fj':= La fecha Juliana. Las partes entera y decimal de 'fj' representan el número de día Juliano y la fracción de día Juliano respectivamente. Con cinco cifras decimales significativas se obtiene la hora con una precisión de 1 segundo. 'fj' puede ser un número negativo. 'fjm':= La fecha Juliana modificada; argumento similar a fj.
pt_br: Argumentos Nota: escrita citações ("") é obrigatória para rendimento de argumentos. 'era':= É a posição do ano em escala-a Cristã. Com 'aC' denota ante Christium ou dantes de Cristo; 'AD', Anno Domini ou após Cristo. 'yy':= No ano com um número maior que zero. No ano zero ou em um ano negativo não existe na escala cristã. 'mm':= No mês com valor numérico (1-12). 'dd':= No dia do mês. 'tt':= A hora solar, tem duas opções de rendimento: escrevendo o tempo universal (UT) em formato 'hh:mm:ss', ou 'md' que é a hora a meio dia de Greenwich (12:00:00 UT). 'dj':= A data Juliana. As partes inteira e decimal de 'dj' representam o número de dia Juliano e a fração de dia Juliano respectivamente. Com cinco cifras decimais obtém-se a hora com uma precisão de 1 segundo. 'fj' pode ser um número negativo. 'djm':= A data Juliana modificada. argumento semelhante a dj.

source: --calc2FJ "(era,yy,mm,dd,tt)" Calculation of Julian date from a calendar date used in the Christian or Western culture. This function assumes the calendars used in Western culture: the Gregorian calendar, currently used for civil purposes, and its predecessor, the Julian calendar, used by the old Roman Empire with use until end of century XVI. Therefore, for a date previous to the 5 of October of 1582 the Julian calendar is assumed, whereas for a date later to the 14 of October of 1582 the Gregorian calendar is assumed.
es: --calc2FJ "(era,yy,mm,dd,tt)" Cálculo de fecha Juliana a partir de una fecha del calendario usado en la cultura Cristiana o Occidental. Esta función asume los calendarios usados en la cultura Occidental: el calendario Gregoriano, usado actualmente para fines civiles, y su antecesor, el calendario Juliano, usado por el antiguo Imperio Romano con vigencia hasta finales del siglo XVI. Por tanto, para una fecha anterior al 5 de Octubre de 1582 se asume el calendario Juliano, mientras que para una fecha posterior al 14 de Octubre de 1582 se asume el calendario Gregoriano.
pt_br: --calc2FJ "(era,yy,mm,dd,tt)" Cálculo de data Juliana a partir de uma data do calendário usado na cultura Cristã ou Ocidental. Esta função assume os calendários usados na cultura Ocidental: o calendário Gregoriano, usado atualmente para fins civis, e seu antecessor, o calendário Juliano, usado pelo antigo Império Romano com vigência até finais do século XVI. Por tanto, para uma data anterior ao 5 de Outubro de 1582 assume-se o calendário Juliano, enquanto para uma data posterior ao 14 de Outubro de 1582 assume-se o calendário Gregoriano.

source: --jul2FJ "(era,yy,mm,dd,tt)" Calculation of Julian date from a Julian calendar date. The function assumes only the Julian calendar.
es: --jul2FJ "(era,yy,mm,dd,tt)" Cálculo de fecha Juliana a partir de una fecha del calendario Juliano. La función asume únicamente el calendario Juliano.
pt_br: --jul2FJ "(era,yy,mm,dd,tt)" Cálculo de data Juliana a partir de uma data do calendário Juliano. A função assume unicamente o calendário Juliano.

source: --greg2FJ "(era,yy,mm,dd,tt)" Calculation of Julian date from a Gregorian calendar date. The function assumes only the Gregorian calendar.
es: --greg2FJ "(era,yy,mm,dd,tt)" Cálculo de fecha Juliana a partir de una fecha del calendario Gregoriano. La función asume únicamente el calendario Gregoriano.
pt_br: --greg2FJ "(era,yy,mm,dd,tt)" Cálculo de data Juliana a partir de uma data do calendário Gregoriano. A função assume unicamente o calendário Gregoriano.

source: --FJ2jul "(jd)" Calculation of a Julian calendar date, time and day of the week from a Julian date. It gives the date with format day of week, era, year, month, day and time UT.
es: --FJ2jul "(fj)" Cálculo de una fecha del calendario Juliano, hora y día de la semana a partir de una fecha Juliana. Entrega la fecha con formato día de la semana, era, año, mes, día y hora UT.
pt_br: --FJ2jul "(dj)" Cálculo de uma data do calendário Juliano, hora e dia da semana a partir de uma data Juliana. Entrega a data com formato dia da semana, era, ano, mês, dia e hora UT.

source: --FJ2greg "(jd)" Calculation of a Gregorian calendar date, time and day of the week from a Julian date. It gives the date with format day of week, era, year, month, day and time UT.
es: --FJ2greg "(fj)" Cálculo de una fecha del calendario Gregoriano, hora y día de la semana a partir de una fecha Juliana. Entrega la fecha con formato día de la semana, era, año, mes, día y hora UT.
pt_br: --FJ2greg "(dj)" Cálculo de uma data do calendário Gregoriano, hora e dia da semana a partir de uma data Juliana. Entrega a data com formato dia da semana, era, ano, mês, dia e hora UT.

source: --calc2FJM "(era,yy,mm,dd,tt)" Calculation of modified Julian date from a Western calendar date. This function is valid for any era.
es: --calc2FJM "(era,yy,mm,dd,tt)" Cálculo de fecha Juliana modificada desde fecha del calendario occidental. Esta función es valida para cualquier era.
pt_br: --calc2FJM "(era,yy,mm,dd,tt)" Cálculo de data Juliana modificada de uma data do calendário Ocidental. Esta função é válida para qualquer era.

source: --FJM2calc "(mjd)" Calculation of a Western calendar date, time and day of the week from a modified Julian date. It gives the date with format day of week, era, year, month, day and time UT.
es: --FJM2calc "(fjm)" Cálculo de una fecha del calendario Occidental, hora y día de la semana a partir de una fecha Juliana modificada. Entrega la fecha con formato día de la semana, era, año, mes, día y hora UT.
pt_br: --FJM2calc "(djm)" Cálculo de uma data do calendário Ocidental, hora e dia da semana a partir de uma data Juliana modificada. Entrega a data com formato dia da semana, era, ano, mês, dia e hora UT.

source: --convcal "(era,yy,mm,dd,cal1,cal2)" Conversion between calendar date 'cal1' to calendar date 'cal2'. The conversion is made between Julian 'jul' and Gregorian 'greg' calendars or vice versa. It gives the date with format era, year, month and day.
es: --convcal "(era,yy,mm,dd,cal1,cal2)" Conversión entre fecha del calendario 'cal1' a fecha del calendario 'cal2'. La conversión se realiza entre calendarios Juliano 'jul' y Gregoriano 'greg' o viceversa. Entrega la fecha con formato era, año, mes y día.
pt_br: --convcal "(era,yy,mm,dd,cal1,cal2)" Conversão entre data do calendário 'cal1' a data do calendário 'cal2'. A conversão realiza-se entre calendários Juliano 'jul' e Gregoriano 'greg' ou vice-versa. Entrega a data com formato era, ano, mês e dia.

source: --mas 'fun' Show additional information about function 'fun', where 'fun' is one of the options: 'calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc| convcal|mas|arg'. The option 'arg' shows additional information on the arguments. For calculate Julian date present, from PC clock, write kalendas without arguments.
es: --mas 'fun' Muestra información adicional sobre función 'fun', donde 'fun' es una de las opciones 'calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc| convcal|mas|arg'. La opción 'arg' muestra información adicional de los argumentos. Para calcular fecha Juliana actual, desde el reloj del PC, escribir kalendas sin argumentos.
pt_br: --mas fun Mostra informação adicional sobre função 'fun', onde 'fun' é uma das opções: 'calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc| convcal|mas|arg'. A opção 'arg' mostra informação adicional dos argumentos. Se não há algum parâmetro na linha de comandos, se avalia a data Juliana desde o relógio do PC.

source: There is not information for: '{arg}'
es: No existe información para: '{arg}'
pt_br: Nenhuma informação para: '{arg}'

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>. This program comes with ABSOLUTELY NO WARRANTY; This is free software, and you are welcome to redistribute it under certain conditions.
es: Licencia GPLv3+: GNU GPL versión 3 o posterior <http://gnu.org/licenses/gpl.html>. Este programa se ofrece SIN GARANTÍA ALGUNA. Es software libre, y usted puede redistribuirlo bajo ciertas condiciones.
pt_br: Licença GPLv3+: GNU GPL versão 3 ou posterior <http://gnu.org/licenses/gpl.html>. Este programa não possui QUALQUER GARANTIA. Este é software livre, e você pode redistribuí-lo sob certas condições.

source: Use: {PROG} --Function "Arguments"
es: Use: {PROG} --Función "Argumentos"
pt_br: Uso: {PROG} --Função "Argumentos"

source: Arguments: 'era' is the position of the year in the Christian scale: 'aC|AD', 'yy' year, 'mm' month (1-12) and 'dd' day, 'tt' hour in UT or noon of Greenwich: 'hh:mm:ss|md'. 'jd' is the Julian date, 'mjd' is the modified Julian date. Functions: --calc2FJ "(era,yy,mm,dd,tt)" Calculation Julian date from a calendar date used in the Western culture. --jul2FJ "(era,yy,mm,dd,tt)" Calculation of Julian date from a Julian calendar date. --greg2FJ "(era,yy,mm,dd,tt)" Calculation of Julian date from a Gregorian calendar date. --FJ2jul "(jd)" Calculation of a Julian calendar date from a Julian date. --FJ2greg "(jd)" Calculation of a Gregorian calendar date from a Julian date. --calc2FJM "(era,yy,mm,dd,tt)" Calculation of modified Julian date from date calendar Western. --FJM2calc "(mjd)" Calculation of date calendar Western from modified Julian date. --convcal "(era,yy,mm,dd,cal1,cal2)", cal_=jul|greg Conversion between calendar date 'cal1' to calendar date 'cal2'. The conversion is made between Julian and Gregorian calendars or vice versa. --mas fun, fun=calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc|convcal|mas|arg Show additional information about function fun; arg show arguments. -h,--help Show this help. -v,--version Show version. JD present! For calculate Julian date present, from PC clock, write
es: Argumentos: 'era' es la posición del año en la escala Cristiana: 'aC|AD', 'yy' el año, 'mm' el mes (1-12) y 'dd' el día, 'tt' la hora en UT o a medio día: 'hh:mm:ss|md'. 'fj' es la fecha Juliana, 'fjm' es la fecha Juliana modificada. Funciones: --calc2FJ "(era,yy,mm,dd,tt)" Calcula fecha Juliana según fecha calendario usado por cultura Occidental. --jul2FJ "(era,yy,mm,dd,tt)" Calcula fecha Juliana a partir de una fecha del calendario Juliano. --greg2FJ "(era,yy,mm,dd,tt)" Calcula fecha Juliana a partir de una fecha del calendario Gregoriano. --FJ2jul "(fj)" Calcula fecha de calendario Juliano a partir de una fecha Juliana. --FJ2greg "(fj)" Calcula fecha de calendario Gregoriano a partir de una fecha Juliana. --calc2FJM "(era,yy,mm,dd,tt)" Cálculo fecha Juliana modificada desde fecha del calendario Occidental. --FJM2calc "(fjm)" Cálculo fecha calendario Occidental desde fecha Juliana modificada. --convcal "(era,yy,mm,dd,cal1,cal2)", cal_=jul|greg Convierte fecha del calendario 'cal1' a fecha del calendario 'cal2'. La conversión es entre calendarios Juliano y Gregoriano o viceversa. --mas fun, fun=calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc|convcal|mas|arg Muestra información adicional sobre función fun; arg muestra argumentos. -h,--help Muestra esta ayuda. -v,--version Muestra versión. FJ actual! Para calcular fecha Juliana actual, desde el reloj del PC,
pt_br: Argumentos: 'era' é a posição do ano em escala-a cristã: 'aC|AD', 'yy' ano, 'mm' mês (1-12), e 'dd' dia, 'tt' tempo em UT ou meio dia de Greenwich 'hh:mm:ss|md'. 'dj' a data Juliana, 'djm' a data Juliana modificada. Funções: --calc2FJ "(era,yy,mm,dd,tt)" Cálculo data Juliana segundo data do calendário usado pela cultura Ocidental. --jul2FJ "(era,yy,mm,dd,tt)" Cálculo de data Juliana a partir de uma data do calendário Juliano. --greg2FJ "(era,yy,mm,dd,tt)" Cálculo de data Juliana a partir de uma data do calendário Gregoriano. --FJ2jul "(dj)" Cálculo de uma data do calendário Juliano, a partir de uma data Juliana. --FJ2greg "(dj)" Cálculo de uma data do calendário Gregoriano, a partir de uma data Juliana. --calc2FJM "(era,yy,mm,dd,tt)" Cálculo a data Juliana modificada a partir de uma data calendário Ocidental. --FJM2calc "(djm)" Cálculo data do calendário Ocidental a partir da data Juliana modificada. --convcal "(era,yy,mm,dd,cal1,cal2)" Conversão entre data do calendário 'cal1' a data do calendário 'cal2'. A conversão realiza-se entre calendários Juliano e Gregoriano ou vice-versa. --mas fun, fun=calc2FJ|jul2FJ|greg2FJ|FJ2jul|FJ2greg|calc2FJM|FJM2calc|convcal|mas|arg Mostra informação adicional sobre função 'fun'; 'arg' mostra argumentos. -h,--help Mostrar esta ajuda. -v,--version Mostra versão. FJ atual! Para calcular a data Juliana atual a partir do relógio do PC,

source: {PROG} without arguments.
es: escribir {PROG} sin argumentos.
pt_br: escrever {PROG} sem argumentos.
